<?php

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class PropertyTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('properties')->insert(
            [ 'user_id' =>'7' ,'type' => '2', 'price'=>'42000','roomNumbers'=>'3','state'=>'1','description'=>'شقة بابراج تل الهوا ١٧٠متر بسعر مغري ٤٢الف نقدا ٣ عرف ٣صالونات ٢ حمام للاتصال ٠٥٩٥٢٦١١٧٧'
                ,'propertyPeriod'=>'4344','street'=>'تل الهوا ','status'=>'0','image'=>'تل الهوا.jpeg','city'=>'0','area'=>'170']
        );
        DB::table('properties')->insert([
            [ 'user_id' =>'9' ,'type' => '4','state'=>'0','description'=>'ا     شاليه الكرمل  متوفر يوم الاحد 9/8  والاثنين 10/8 والاربعاء 12/8 فترة مسائية العنوان الشيخ عجلين شارع كريزي ووتر  للحجز والاستفسار  0594010033 0594133303'
                ,'street'=>'الشيخ عجلين شارع كريزي','status'=>'0','image'=>'الشيخ عجلين.jpeg','city'=>'0','area'=>'250'],
            [ 'user_id' =>'3' ,'type' => '1', 'state'=>'1','description'=>'موجود قطعة أرض مساحتها 261 متر في رفح -الفرقان 1 خلف مسجد حلمي صقر واجهة غربية 14.5 متر '
                ,'street'=>'الفرقان','status'=>'0','image'=>'ارض2.jpeg','city'=>'1','area'=>'261']]);
       
        DB::table('properties')->insert([
            [ 'user_id' =>'5' ,'type' => '2','roomNumbers'=>'3','state'=>'1','description'=>'شقة 200م تشطيب راقي للبيع الطابق الرابع بعمارة فندقية متكاملة الخدمات صالونين و3غرف و 3حمامات ومطبخين وبلكونة غزة_الرمال الجنوبي ابو محمد للعقارات 0597106483'
                ,'street'=>'الرمال الجنوبي','status'=>'0','image'=>'الرمال الجنوبي.jpeg','city'=>'0','area'=>'200'],
            [ 'user_id' =>'3' ,'type' => '2','roomNumbers'=>'2','state'=>'1','description'=>'شقة100متر مشطبة سوبر لوكس شارع حميد مقابل سويدي الشاطئ شمالي غربي الطابق الخامس إطلالة مميزة على البحر صالون كبير وغرفة نوم وغرفة اطفال وحمامين ومطبخ للتواصل على الرقم 0599893457'
                ,'street'=>' شارع حميد ','status'=>'0','image'=>'شارع حميد.jpeg','city'=>'0','area'=>'100']]);
                DB::table('properties')->insert([
                    [ 'user_id' =>'6' ,'type' => '3', 'roomNumbers'=>'4','state'=>'1','description'=>'منزل للبيع ..الشيخ رضوان الأرض 270متر والبناء 200متر عبارة عن حاصلين وخلفهم شقة مشطبة وطابقين كل طابق شقة وممكن ينقسمو لشقتين والسطح فى عمدان جاهز السقف التالت المراجعة والاستفسار رقم 0598152153'
                        ,'street'=>'الشيخ رضوان','status'=>'0','image'=>'الشيخ رضوان.jpeg','city'=>'0','area'=>'270'],
                    [ 'user_id' =>'10' ,'type' => '3', 'roomNumbers'=>'5', 'state'=>'1','description'=>'منزل للبيع مكون من طابقين مساحته 150 متر الطابق الأول مكون من غرفة و حمام ومظلة واسعة الطابق الثاني مكون من 4 غرف وحمامين وصالة ومطبخ وبلكونة  المكان غزة اول الشجاعية إجديدة. لتواصل ع صاحب المنزل 0599396942'
                        ,'street'=>'اول الشجاعية','status'=>'0','image'=>'اول الشجاعية.jpeg','city'=>'0','area'=>'150'],
                    [ 'user_id' =>'8' ,'type' => '3', 'roomNumbers'=>'2', 'state'=>'1','description'=>'دار للبيع معسكر الشاطئ شارع واسع مشكلة الطاير فقط ١١٩متر غرفتين صالون مطبخ حمام إلي ناوي يشتري مراعاة جميلة جدا ٠٥٩٥٢٥٤٠٨٤ '
                        ,'street'=>'معسكر الشاطئ','status'=>'0','image'=>'معسكر الشاطئ.jpeg','city'=>'0','area'=>'119'],
        
                ]);
        DB::table('properties')->insert([
            [ 'user_id' =>'4' ,'type' => '2','price'=>'65000','roomNumbers'=>'5','state'=>'1','description'=>'شقة للبيع تتكون من 5 غرف ومطبخ وصالونين كبار و3 حمامات الطابق الاول المساحة 220 متر شرقي جنوبي مطلوب 65000الف دولار وقابل للتفاوض عمارة سكنية حديثة البناء منطقة الرمال بلقرب برج الشفاء مكتب الفخامة للعقارات للاستفار : 0592230728 ابو احمد 0599871508 ابو فادي','street'=>' منطقة الرمال بلقرب برج الشفاء ','status'=>'0','image'=>'منطقة الرمال بلقرب برج الشفاء.jpeg','city'=>'0','area'=>'220'],
            [ 'user_id' =>'4' ,'type' => '2','price'=>'28000','roomNumbers'=>'0','state'=>'1','description'=>'شقة عظم في عمارة حديثة البناء المساحة 100 متر الطابق الاول شرقي شمالي مطلوب 28000 الف دولار عمارة سكنية حديثة البناء مكونة من 5 طوابق النصر الشرقي مكتب الفخامة للعقارات للتواصل 0592230728 ابو احمد 0599871508 ابو فادي','street'=>' النصر الشرقي ','status'=>'0','image'=>'النصر الشرقي.jpeg','city'=>'0','area'=>'100'],
            [ 'user_id' =>'2' ,'type' => '3','price'=>'128571','roomNumbers'=>'3','state'=>'1', 'description'=>' دار 256م للبيع طابقين الطابق الاول مظلة وغرفة وحمام والطابق التاني 4 غرف ومطبخ و3 حمامات وصالونين  '
                ,'street'=>'دوار زمو بجانب مدرسة شهداء جباليا ','status'=>'0','image'=>'دار عزيز.jpg','city'=>'0','area'=>'256']
        ]);
        DB::table('properties')->insert([
            [ 'user_id' =>'2' ,'type' => '1','price'=>'85000', 'state'=>'1'
                ,'description'=>'للبيع  قطعة ارض طابو 930 بحر خانيونس المواصي شرق مسجد حنين تبعد عن شارع الرشيد 100م  يوصلها شارع 8م من شارع رئيسى يحدها من الشمال شاليه عكيلة منطقة سياحية راقية جدا  بسعر مميز 85 دينار للمتر  للتواصل 0595899125 ','street'=>'شارع الرشيد','status'=>'0','image'=>'ارض4.jpeg','city'=>'2','area'=>'261'],
            [ 'user_id' =>'2' ,'type' => '4','price'=>'75','state'=>'0','description'=>' شالية النافورة  فترة الحجز لدينا ١٦ساعة  ٣٠٠ش فقط  #استمتع بسهرتك مع احلى الحبايب  #تميزنا بفهم حاجتكم للحجز الاتصال على ٠٥٩٢١٠٦٠٨٠ المكان: غزة شرق مفترق نتساريم بعد محطة أبو جبة مدخل وادي غزة يرحب بكم'
                ,'street'=>'مفترق نتساريم','status'=>'0','image'=>'مفترق نتساريم.jpeg','city'=>'0','area'=>'250']]);
        DB::table('properties')->insert([
            [ 'user_id' =>'11' ,'type' => '1', 'state'=>'1'
                ,'description'=>'للبيع قطعة ارض 250 متر شارع عايدية مقابل مؤسسة المسحال للتواصل 0599760017','street'=>'شارع عايدية','status'=>'0','image'=>'ارض3.jpeg','city'=>'0','area'=>'250'],
            [ 'user_id' =>'2' ,'type' => '4','state'=>'0','description'=>'شاليه الرحاب للحجز 0598782222 يمتاز شاليه الرحاب بموقع مميز جدا على شارع الساحل البحر مباشرة (شارع الرشيد) أمام مفترق الزهرة المساحة الكبيرة للشاليه دونم تقريبا  مبنى خدمات غرفة نوم + غرفة استراحة + مطبخ + 3 حمامات مساحة واسعة من الانجيل  بركة للسباحة مساحة 11.5 × 5.5  بركة للأطفال تلفزيون شاشة LCD  طاولة بلياردو  أدوات مطبخ + غاز + فريزر ألعاب أطفال شواية خاصة  مدخل للسيارة انترنت wifi اطلالة مباشرة على ساحل البحر للتواصل والحجز 0598782222'
                ,'street'=>'شارع الرشيد','status'=>'0','image'=>'شارع الرشيد شاليه الرحاب.jpeg','city'=>'0','area'=>'250']]);
    }
}
